OpenFOAM-3.0.0/tutorials/combustion/fireFoam/les/smallPoolFire2D/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory


# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh
runApplication topoSet
runApplication createPatch -overwrite

# Run
runApplication `getApplication`

# ----------------------------------------------------------------- end-of-file
